{
    "courses": [
        {
            "id": 1,
            "image": "images/computing.png",
            "course": "Business Computing BSc (Hons)",
            "ucascode": "G503",
            "level": "Undergraduate",
            "description": "Business Computing BSc (Hons) shares a common first year with other Computing pathways, with flexible progression into the second year. On Business Computing you will have the option to tailor your second and third years to specialise to suit your career aspirations and curiosities. After your second year, you have the opportunity to work on a placement year, learning in industry and creating contacts that will be valuable when you graduate, improving your chances of getting the first step in your future career. In the final year, you will study Security, Business Intelligence and Project Management at greater depth as you develop your strategic skills alongside the practical ones. You will have the option to choose to develop a practical build for your dissertation or research and evaluate emerging technologies. With the skills, knowledge and experience you have gained from the course, you will be well equipped to enter the workplace or continue with further study to best fulfil your personal ambitions and potential.",
            "starting": "September",
            "duration": {
                "fulltime": "3 Years",
                "parttime": "4 -6 Years",
                "fulltimefoundation": "4 Years"
            },
            "fees": {
                "ukfees": {
                    "fulltime": 9250,
                    "parttime": 1540,
                    "integratedfoundationyear": 9250
                },
                "internationalfees": {
                    "fulltime": 14750,
                    "integratedfoundationyear": 14750
                },
                "optionalworkplacementyear": 0
            },
            "location": "Waterside",
            "contact": {
                "uk/eustudents": {
                    "email": "study@northampton.ac.uk",
                    "phone": "0300 303 2772"
                },
                "internationalstudents": {
                    "email": "international@northampton.ac.uk",
                    "phone": "+44 (0)1604 893981"
                }
            },
            "entryrequirements": {
                "standard": {
                    "alevel": "BCC",
                    "btec": "DMM",
                    "tlevel": "Pass"
                },
                "integratedfoundationyear": {
                    "alevel": "DEE",
                    "btec": "MPP",
                    "tlevel": "Pass"
                },
                "englishlanguagerequirements": "IELTS 6.0 with a minimum of 5.5 in all bands"
            },
            "yearone": {
                "moduleone": "CSY1030 – Digital Footprints, Credits: 20",
                "descriptionone": "The purpose of this module is ?to understand and apply and the principles of data integrity and protection to take responsibility for managing and capitalising on your online presence. Digital footprint is a self-managed, online module that considers the data trail and shadow left by interactions in digital environments. The module develops a broad understanding of the impact of individual and organisational online presence in the context of digital marketing, data protection, ethical issues and good practice to optimise employability and prospects.",
                "moduletwo": "CSY1061 – Computer Systems, Credits: 20",
                "descriptiontwo": "This module provides knowledge of the hardware and software components that make up a computer system and overview the important concepts in preparation for future study of computer science.",
                "modulethree": "CSY1063 – Web Development, Credits: 20",
                "descriptionthree": "This purpose of this module is to give students an understanding of client side web technologies. This module provides students with: the essential knowledge and practical skills to design, develop and implement a Web site to contemmporary web standard",
                "modulefour": "CSY1064 – Software Engineering Fundamentals, Credits: 20",
                "descriptionfour": "The purpose of this module is to develop student's experience with the multiple stages of software engineering life-cycles from initial need and requirements identification through to the design and implementation of code in order to develop confidence in the use of terminology and techniques for each of the stages.",
                "modulefive": "CSY1020 – Problem Solving and Programming, Credits: 20",
                "descriptionfive": "This purpose of this module is to: introduce students to the skills, principles and concepts necessary to solve problems in computing; to develop essential skills to enable the solution of these problems with the construction of appropriate algorithms and a computer program; introduce principles underlying the design of a high level programming language (HLPL); gain experience and confidence in the use of a HLPL to implement algorithms; implement HLPL programs using an appropriate programming language e.g. Java; introduce an object-oriented language initially as a non-object language.",
                "modulesix": "CSY1065 – Databases Design and Development, Credits: 20",
                "descriptionsix": "The purpose of this module is to apply the principles of database integrity in the design and development of database structures. This is a practical module that applies data modelling techniques to establish, modify and maintain database integrity, structures and associated components such as entities, relationships and attribute definitions."
            },
            "yeartwo": {
                "moduleone": "CSY2041 – Quality and User-Centred Systems, Credits: 20",
                "descriptionone": "Creating high quality information systems involves many different factors and all stages of the lifecycle. It relies on the establishment of standards, guidelines and techniques at each stage, and on a quality culture which embeds quality by design. Through this module you will build up a thorough understanding of the complexity of the user-technology relationship and how to ensure that the developed system fits the user needs and expectations.",
                "moduletwo": "CSY2042 – Website Management, Credits: 20",
                "descriptiontwo": "The purpose of this module is ? Developing a new website is one small part of the overall lifecycle. Managing and maintaining a site calls on a wide variety of skills, from content management to understanding the legal context of ownership, from people skills to implementing added functionality. This module introduces you to the varied talents required of a successful WebMaster.",
                "modulethree": "CSY2088 – Group Project, Credits: 20",
                "descriptionthree": "The module is designed to develop higher-order intellectual skills (problem-solving) and appropriate personal qualities including team working. Each group will develop and document effective, robust and high-quality computing systems to a professional standard in response to a supplied specification of requirements.",
                "modulefour": "CSY2089 – Web Programming, Credits: 20",
                "descriptionfour": "This purpose of this module is to give students an understanding of the conceps and technologies of web based server side technologies; teach students to use up-to-date programming techniques to design and develop coherent server side software for websites with a focus on security, functionality and usability.",
                "modulefive": "CSY2093 – Object-Relational Databases, Credits: 20",
                "descriptionfive": "The purpose of this module is to develop the fundamental concepts and skills of Entity Relational Models (ERMs) and Structured Query Language (SQL). It introduces extended-relational databases; user-defined types, their practical creation, application along with valuable data extraction methods to provide intelligence and database programming (PL/SQL).",
                "modulesix": "CSY2094 – Systems Design and Development, Credits: 20",
                "descriptionsix": "This purpose of this module is to extend and apply system design and development to large scale systems; explore building GUIs so that the idea of specifying general software components and implementing re-usable classes will become familiar; provide tools and skills which the student will require when encountering design projects."
            },
            "yearthree": {
                "moduleone": "CSY3059 – Modern Databases, Credits: 20",
                "descriptionone": "The purpose of this module is to study advanced/latest database topics. The module focuses primarily on NoSQL databases (e.g., graph and document databases), from designing and creating to querying the databases.",
                "moduletwo": "CSY3034 – Business Intelligence, Credits: 20",
                "descriptiontwo": "The purpose of this module is the link between business and IT, allowing student to use and evaluate technologies and infrastructures needed to synthesize valuable information providing businesses with a competitive edge. Data analysis, reporting, and query tools are used to develop insights for business decisions. Business Intelligence (BI) represents a category of applications and technologies for gathering, storing, visualising, analysing, and providing access to data to make informed business decisions.",
                "modulethree": "CSY3037 – IT Project Management, Credits: 20",
                "descriptionthree": "This purpose of this module is for students to absorb a considerable body of knowledge, which can then be reinforced by application of the theory. The module therefore employs a combination of theory and practice using real or simulated IT projects of diverse sizes. Content will be delivered by lecture and workshop sessions. Students? understanding of the theory will be tested by time-constrained assessment. Practical assignments will be based around a scenario (e.g. development of a database system requiring coordination of a diverse team comprising designers and programmers) and require students to work in groups, planning and controlling the project.",
                "modulefour": "CSY3062 – Cybersecurity and Applied Cryptography, Credits: 20",
                "descriptionfour": "This module provides students with the necessary practical skills and theoretical understanding of the technologies used to secure communications and protect the privacy of users within an online environment. Concepts introduced, and skills learnt, provide the necessary technical underpinning to enable the student to address the issues of effective Security.",
                "modulefive": "CSY3058 – Media Technology, Credits: 20",
                "descriptionfive": "Media Technology is an important aspect to Computer Science. This module will introduce a range of technologies relevant to modern multimedia systems. This includes computer graphics, digital image processing, online video streaming, immersive media, and other advanced applications. Student will develop audio-visual systems in a third generation computer language.",
                "modulesix": "CSY4022 – Computing Project Dissertation, Credits: 40",
                "descriptionsix": "This project module provides the opportunity for the student to undertake independent research, development, and self-management of a Computing related project leading to completing a dissertation. An essential outcome for this module is that the student?s project deliverable includes the design and development of a system, or a software application, or a novel functional approach that relates to the main areas of student study, and that can be used, applied or demonstrated in some way. Students on the BSc Business Computing may engage on a research centered project resulting in a report of analysis of an appropriate topic."
            },
            "studentsstatifiedwithcourse": "55%"
        },
        {
            "id": 2,
            "image": "images/accounting.png",
            "course": "Accounting and Finance BSc (Hons)",
            "ucascode": "N420",
            "level": "Undergraduate",
            "description": "The Accounting and Finance BSc will begin by considering the practical techniques involved in accounting and finance and then continue to develop skills to critically analyse the theory behind these techniques. It will also develop the interdisciplinary nature of business and integrate accounting with broader subject areas such as economics, law and human resources. <br><br>There is also the option to complete a year’s work placement to prepare you for your future career. <br><br>Nationwide, MacIntyre Hudson and Mazars are examples of recent visits and are also some of the sponsors who provide prizes at our annual awards ceremony. Local sponsors include Grant Thorntons, Hawsons and Elsby. Elsby are a growing company who will be developing a ‘Young Professionals Networking Platform’ in conjunction with the university in the very near future. <br><br>At the Accounting, Finance and Banking Awards, which were incorporated into our Graduation celebrations, £1,000 was given out in prize money to our students. Grant Thorntons, Hawsons Chartered Accountants, McIntyre Hudson and Mazars were amongst the companies sponsoring these awards.",
            "starting": "September",
            "duration": {
                "fulltime": "3 Years",
                "parttime": "4 - 6 Years",
                "fulltimefoundation": "N/A"
            },
            "fees": {
                "ukfees": {
                    "fulltime": 9250,
                    "parttime": 1540,
                    "integratedfoundationyear": 0
                },
                "internationalfees": {
                    "fulltime": 14750,
                    "integratedfoundationyear": 0
                },
                "optionalworkplacementyear": 1200
            },
            "location": "Waterside",
            "contact": {
                "uk/eustudents": {
                    "email": "study@northampton.ac.uk",
                    "phone": "0300 303 2772"
                },
                "internationalstudents": {
                    "email": "international@northampton.ac.uk",
                    "phone": "+44 (0)1604 893981"
                }
            },
            "entryrequirements": {
                "standard": {
                    "alevel": "BBC",
                    "btec": "DDM",
                    "tlevel": "M"
                },
                "integratedfoundationyear": {
                    "alevel": "N/A",
                    "btec": "N/A",
                    "tlevel": "N/A"
                },
                "englishlanguagerequirements": "IELTS 6.0 with a minimum of 5.5 in all bands"
            },
            "yearone": {
                "moduleone": "ACC1025 Financial Skills for Business, Credits: 20",
                "descriptionone": "You will have the opportunity to collect, present, analyse and interpret numerical data. You will explore the basic concepts of business mathematics, financial models and statistical methods, which lay the foundation for application of quantitative techniques to support decision making.",
                "moduletwo": "ACC1026 Fundamentals of Management Accounting, Credits: 20",
                "descriptiontwo": "You will apply current and emerging management accounting tools and techniques for controlling, planning and decision making in the modern competitive organisational environment.",
                "modulethree": "ACC1027 Practical Financial Accounting, Credits: 20",
                "descriptionthree": "This module introduces you to terminology, concepts, principles, procedures and techniques of accounting. It provides an essential introduction to the preparation and presentation of financial statements and their relevance to stakeholders and other users.",
                "modulefour": "ACC1028 Responsible Accounting, Credits: 20",
                "descriptionfour": "You will explore the principles of responsible accounting built on the foundation of social and environmental justice to promote sustainability within organizations. By applying the sustainable development goals (SDGs), you will explore contemporary global issues related to the transition to responsible business within organisations at international and local levels.",
                "modulefive": "ACC1029 Corporate and Business Law, Credits: 20",
                "descriptionfive": "You will be introduced to the general legal framework related to a range of business activities and appreciate when to seek specialist legal advice.",
                "modulesix": "ACC1030 Digital & Economic Environment, Credits: 20",
                "descriptionsix": "You will investigate the economic and digital environment within which accountants and other managers operate. The module equips you with the skills for the use of technology in the management of data and creation of value for organisations."
            },
            "yeartwo": {
                "moduleone": "ACC2001 Financial Management, Credits: 20",
                "descriptionone": "This module introduces you to the financing decision and the role of the financial manager in modern corporations. Central to the achievement of the above is a sound knowledge of sources of finance (including capital markets) and a clear understanding and application of the techniques that lead to the justifiable investment and dividend decisions.",
                "moduletwo": "ACC2038 Digital Business and Finance, Credits: 20",
                "descriptiontwo": "You will explore the technologies that drive the digital world in which finance operates, and how finance professionals manage data to create and preserve value for organisations. You will examine the skills and competencies framework that finance professionals need to fulfil their roles and to interact with other business areas.",
                "modulethree": "ACC2040 Principles of Taxation, Credits: 20",
                "descriptionthree": "You will explore the impact of taxation on the financial strategy of individuals and organisations – commercial and non-commercial, national and international. You will apply taxation rules and regulations to assess the effect on financial decision-making.",
                "modulefour": "ACC2041 Applied Financial Reporting, Credits: 20",
                "descriptionfour": "In this module you apply accounting standards and the theoretical framework to the preparation, presentation, and interpretation of financial statements. of companies and groups.",
                "modulefive": "ACC2042 Management Accounting for Decision Making, Credits: 20",
                "descriptionfive": "ou will apply and evaluate current and emerging management accounting tools and techniques for managing performance to achieve organisational objectives.",
                "modulesix": "ACC2043 The Professional Accountant, Credits: 20",
                "descriptionsix": "You will explore the role of professional accountants in organisations, applying relevant professional standards. There is a strong emphasis on the role of governance and accountability on efficient, effective and ethical management of an organisation."
            },
            "yearthree": {
                "moduleone": "CC3009 Corporate Finance, Credits: 20",
                "descriptionone": "The purpose of this module is to equip you with theoretical and practical skills in contemporary corporate finance. You explore the complexities of corporate financial management, investment decision making and financial risk.",
                "moduletwo": "ACC3040 Financial Business Partnering, Credits: 20",
                "descriptiontwo": "You will analyse and manage costs to support the implementation of the organisation’s strategy and to control the performance of the organisation. You will be able to apply investment appraisal techniques to evaluate capital investments, and evaluate the risks associated with such decisions.",
                "modulethree": "ACC3041 International Financial Reporting, Credits: 20",
                "descriptionthree": "This module equips you to become skilled preparers, analysts and interpreters of published accounts in light of the IFRS. This includes a synthesis of the accounting policies, contemporary developments in accounting regulation and changes in financial reporting standards.",
                "modulefour": "ACC3042 Practical Auditing, Credits: 20",
                "descriptionfour": "You will critically explore the legal and regulatory environment of assurance engagement. They will apply professional and ethical considerations to critically identify, analyse and conclude on best practice of accountability and transparency.",
                "modulefive": "ACC3043 Strategy and Leadership, Credits: 20",
                "descriptionfive": "In this module you adopt a holistic and integrated approach to organisational leadership, from external and internal perspectives. The module is centred on the concept of business and financial strategy and how it can be implemented through people, projects, processes and relationships.",
                "modulesix": "ACC4010 Project, Credits: 40",
                "descriptionsix": "In this module you will analyse organisational performance, examining core areas of accounting and finance to evaluate strategic decision making. You will further enhance their independent research skills through the investigation of real world scenarios to identify trends and propose responsible and sustainable solutions to challenges faced by organisations."
            },
            "studentsstatifiedwithcourse": "85%"
        },
        {
            "id": 3,
            "image": "images/advertising.png",
            "course": "Advertising & Digital Marketing BA (Hons)",
            "ucascode": "N564",
            "level": "Undergraduate",
            "description": "The advertising industry has been transformed by the digital and social media revolution. From start-ups to big businesses, from social enterprises to charities and the public sector, this discipline offers careers in a wide range of industry sectors. Experiences are at the heart of our advertising degree. As well as regular guest speakers and industry visits, we work on real projects with real marketing budgets. We operate as a marketing department from the first year. Typically, you will be set a brief and then develop and pitch your concept. You will work within brand guidelines, often appointing suppliers, like photographers or design agencies, to deliver your project.",
            "starting": "September",
            "duration": {
                "fulltime": "3 Years",
                "parttime": "4 Years",
                "fulltimefoundation": "4 Years"
            },
            "fees": {
                "ukfees": {
                    "fulltime": 9250,
                    "parttime": 1540,
                    "integratedfoundationyear": 9250
                },
                "internationalfees": {
                    "fulltime": 14750,
                    "integratedfoundationyear": 14750
                },
                "optionalworkplacementyear": 1100
            },
            "location": "Waterside",
            "contact": {
                "uk/eustudents": {
                    "email": "study@northampton.ac.uk",
                    "phone": "0300 303 2772"
                },
                "internationalstudents": {
                    "email": "international@northampton.ac.uk",
                    "phone": "+44 (0)1604 893981"
                }
            },
            "entryrequirements": {
                "standard": {
                    "alevel": "BCC",
                    "btec": "DMM",
                    "tlevel": "Pass"
                },
                "integratedfoundationyear": {
                    "alevel": "DEE",
                    "btec": "MPP",
                    "tlevel": "Pass"
                },
                "englishlanguagerequirements": "IELTS 6.0 with a minimum of 5.5 in all bands"
            },
            "yearone": {
                "moduleone": "Foundations of Marketing, Credits: 20",
                "descriptionone": "The purpose of this module is to introduce the concept of marketing to students. To explain what marketing is and to show the way in which marketing impacts on organisations, customers and other stakeholders. The idea of ?creating value? is central to a marketing orientation and this module seeks to explain what this means in a rapidly changing external environment.",
                "moduletwo": "Introduction to Marketing Communications, Credits: 20",
                "descriptiontwo": "The purpose of this module is to provide students with an opportunity to explore current and emerging practices in marketing communications across a range of industries and sectors.",
                "modulethree": "Foundations of Advertising Media, Credits: 20",
                "descriptionthree": "The purpose of this module is to provide an opportunity for students to learn about a variety of advertising media such as Television, Radio and Out of Homeand develop an understanding of the key concepts around media selection, audiences and buying.Students will go on to experience the challenge of creating a campaign, with particular focus on the creative thinking and project management, essential for an advertising environment.",
                "modulefour": "Digital Marketing Essentials, Credits: 20",
                "descriptionfour": "This module provides students with the skills and knowledge necessary to both plan and analyze digital marketing campaigns to achieve specific, strategic commercial objectives within a broad range of contemporary organisations.",
                "modulefive": "Understanding Consumers, Credits: 20",
                "descriptionfive": "The purpose of this module is to provide an overview of the importance of consumer behaviour and the relationship between understanding consumers and its impact on business. This module will focus on understanding the basis for consumer behaviour, and the importance to marketers in understanding the factors that affect it, including psychological, personal, social and technological factors.",
                "modulesix": "Professional Skills for Marketing Practice, Credits: 20",
                "descriptionsix": "This module will equip students with the practical skills needed to undertake effective research and analysis. Students will learn to differentiate a range of marketing research strategies and use a selection of marketing research techniques to initiate and undertake critical analysis, applying findings to solve a set marketing problem and to approach the analysis of the business environment when conducting marketing audits applied to specific brands, companies and industry sectors. This is a skills-module and as such its focus is on the learning of the practical real-life skills required by professional marketers when conducting research in business."
            },
            "yeartwo": {
                "moduleone": "E-Marketing, Credits: 20",
                "descriptionone": "This module will review the customer journey in a fragmented media and device environment, and will exmaine the new role of the customer in a world where customers can communicate with brands and other customers. We will explore ecommerce and review essential evaluation methods and tools. This module will also provide students with the opportunity to experiment with digital marketing tools to improve their employabiltyDrawing on scholarly research, as well as current business practice, we will examine, analyse and evaluate the most important marketing issues facing companies today who wish to succeed in this dynamic new digital environment.",
                "moduletwo": "Integrated Marketing Communications, Credits: 20",
                "descriptiontwo": "The purpose of this module is to develop an understanding of Integrated Marketing Communications theory, and the scope of the integrated communication process in practice as both a philosophy and as a process model. More specifically, the module outlines an outside-in approach that is important to understand and appreciate the context of communication to consumers and stakeholders. It examines methods for creating an insightful overview of the target audience both internally and externally, and investigates key influences for building effective engagement through integrated marketing communications.",
                "modulethree": "Public Relations Management and Practice, Credits: 20",
                "descriptionthree": "The purpose of this module is to explore a range of PR management tools and techniques across the exciting and diverse PR industry. Students will learn about the function of PR as part of integrated marketing communications, as well as examining the role of PR within crisis management, event management, the not-for-profit sector, public affairs, and internal and external communications.",
                "modulefour": "Professional Practice for the Creative Industries, Credits: 20",
                "descriptionfour": "This module will focus on developing students' commercial awareness within the context of the creative industries through the use of academic and practioner sources. Students will be provided with the opportunity to evaluate the interface between academic sources and application in practice, through research and networking activities.",
                "modulefive": "Managing the Communications Process, Credits: 20",
                "descriptionfive": "The purpose of this module is to focus on the process of campaign planning and execution for an Advertising / Marketing Communications application. This will involve undertaking `problem-based? projects and selecting messages, tools and media appropriate for an effective campaign. Students will experience managing the communications project from concept to content production.",
                "modulesix": "Marketing Research and Insight, Credits: 20",
                "descriptionsix": "The purpose of this module is to enable students to develop a detailed understanding of the way in which research informs a range of key marketing decisions. Students will explore the concepts and practice of marketing research, developing both a methodological understanding and the practical skills required to locate, gather, interpret and apply relevant data to marketing problems and to gain marketing insight"
            },
            "yearthree": {
                "moduleone": "Issues in Advertising Practice, Credits: 20",
                "descriptionone": "This module explores current trends and challenges in advertising, with a view to developing a point of view on key issues and a working understanding of the regulations and codes of conduct governing the industry.Topics such as stereotyping, sustainability, consumer power and ethics will be tackled from both a consumer and an industry perspective.",
                "moduletwo": "Content Creation for Marketing, Credits: 20",
                "descriptiontwo": "The purpose of this module is to focus on the development and building of professionally relevant content on a variety of platforms which will enable the student to develop skills in real time, relevant marketing communications and content creation.The creation of content will be linked to relevant academic theory in communication and visual language which will underpin the student?s choices.",
                "modulethree": "Digital Entrepreneur, Credits: 20",
                "descriptionthree": "To remain competitive in today's digital world, businesses need to move fast. Digital entrepreneurship module will focus on issues related to creating and doing business in the Digital Era. Main emphasis of the module is on practical aspects of digital entrepreneurship, including digital entrepreneurship skills, tools, practices and processes.",
                "modulefour": "Consumerism and Sustainability, Credits: 20",
                "descriptionfour": "This module will cover issues relating to consumer behaviour in the globalised marketplace that defines the world today. Issues that will be covered will include the emergence of a consumer culture, the `cult of consumerism? and its effects on the planet. Topics including the ecological footprint of consumers, sustainable marketing, ethical issues in marketing, social marketing will be viewed in the context of the development of consumer desire and the growth of consumerism and its impact on the environment.",
                "modulefive": "Research Project, Credits: 20",
                "descriptionfive": "The purpose of this module is to provide students with an opportunity to carry out an investigation of a current industry or market sector topic or issue that is relevant to their degree or professional development. This will typically result in the identification of a problem, trend or research issue that is subsequently examined during the project. Students apply relevant academic or marketing concepts to structure their investigation and to communicate their analysis.",
                "modulesix": "Marketing Dissertation, Credits: 40",
                "descriptionsix": "The overall aim of the module is to develop advanced personal scholarship skills and subject knowledge through the design and conduct of an independent piece of academically rigorous research."
            },
            "studentsstatifiedwithcourse": "83%"
        },
        {
            "id": 4,
            "image": "images/architechture.png",
            "course": "Architectural Technology BSc (Hons)",
            "ucascode": "K210",
            "level": "Undergraduate",
            "description": "Our BSc Architectural Technology course has been accredited by the Chartered Institute of Architectural Technologists (CIAT) and has also been recently redeveloped to align with the newest QAA Subject Benchmark Statement for Architectural Technology. Our curriculum has three key themes: Presentation, Technology, and Professional Practice and Design, each one being taught over the three years of your time studying Architectural Technology at university, covering various subjects with complexity and depth.",
            "starting": "September",
            "duration": {
                "fulltime": "3 Years",
                "parttime": "4 - 6 Years",
                "fulltimefoundation": "4 Years"
            },
            "fees": {
                "ukfees": {
                    "fulltime": 9250,
                    "parttime": 1540,
                    "integratedfoundationyear": 9250
                },
                "internationalfees": {
                    "fulltime": 14750,
                    "integratedfoundationyear": 14750
                },
                "optionalworkplacementyear": 0
            },
            "location": "Waterside",
            "contact": {
                "uk/eustudents": {
                    "email": "study@northampton.ac.uk",
                    "phone": "0300 303 2772"
                },
                "internationalstudents": {
                    "email": "international@northampton.ac.uk",
                    "phone": "+44 (0)1604 893981"
                }
            },
            "entryrequirements": {
                "standard": {
                    "alevel": "BCC",
                    "btec": "DMM",
                    "tlevel": "Pass"
                },
                "integratedfoundationyear": {
                    "alevel": "DEE",
                    "btec": "MPP",
                    "tlevel": "Pass"
                },
                "englishlanguagerequirements": "IELTS 6.0 with a minimum of 5.5 in all bands"
            },
            "yearone": {
                "moduleone": "Visual and Technical Communication, Credits: 40",
                "descriptionone": "Comprehending the relationship, validity and application of manual, analogue and digital communication skills are essential for an architectural technologist. Materials, scale/volume, texture/elements, objects and their properties are taught within the context of the theory of the built-environment. Sketching, model-making, drawing, visual/verbal presentation methods are developed. Digital skills are introduced using industry-specific software.",
                "moduletwo": "The Architectural Technologist, Credits: 20",
                "descriptiontwo": "This module focuses on the evolution of Architectural Technology using contemporary and historic precedents to illustrate this journey. The roles of client, designer and constructor are reviewed in context. Following the British Standards, surveying standards, sustainability codes, and theories of Architecture and Built environment, the students will progress with their case studies.",
                "modulethree": "Principles of Technical Design in Architecture, Credits: 40",
                "descriptionthree": "This module introduces students to the basic principles, concepts and vocabulary of architectural technology. It enables students to understand the scientific principles underlying the stability of a building and the control of the environment and to undertake basic design calculations referring to British standards.",
                "modulefour": "Architectural Design, Credits: 20",
                "descriptionfour": "This introductory module to Architectural design will introduce the principles of architectural design and ideation. Students will learn how to gather information necessary for designing a building; information on the function of a project, its occupiers and other stakeholders, the surroundings, spatial requirements of the building.",
                "modulefive": "",
                "descriptionfive": "",
                "modulesix": "",
                "descriptionsix": ""
            },
            "yeartwo": {
                "moduleone": "Building Information Modelling, Credits: 20",
                "descriptionone": "Building on the computer skills gained at Level 4, this module revolves around the current industry software and practical information and performance management requirements. The module focuses on these requirements to develop critical skills required in BIM modeling and building performance analysis.",
                "moduletwo": "Practice, Regulations and Conventions in Architecture, Credits: 20",
                "descriptiontwo": "This module develops a practical knowledge of core legal, regulatory and business requirements for securing approval, development and implementation of built environment proposals. This module covers the understanding of the benefits and application of design codes, planning law, planning frameworks, quality and sustainability standards, the Building Regulations and Party Wall.",
                "modulethree": "Design Specification and Production Information, Credits: 40",
                "descriptionthree": "The selection of materials and components is critical to the success of an architectural proposal. In this module students learn to conduct in-depth industry focused investigations into the application of appropriate materials and/or components in collaboration with industry partners and to develop detailed design drawings associated with the specification.",
                "modulefour": "Technical Architectural Design 1, Credits: 20",
                "descriptionfour": "The purpose of this module is to develop learners? ability to analyse and interprete given briefs as well as develop architectural design up to the developed design stage in line with the industry standard practices. This is achieved through `live? project brief and precedent studies on small scale residential, commercial, institutional or mix-use project.",
                "modulefive": "Technical Architectural Design 2, Credits: 20",
                "descriptionfive": "The purpose of this module is to develop learners? skills to produce technical architectural drawings and detailing from developed architectural design schemes for residential, commercial, institutional or mix-use buildings. This is achieved through critical analysis and evaluation of a development architectural design scheme and application of established working practice, concepts, principles and relevant regulations.",
                "modulesix": "",
                "descriptionsix": ""
            },
            "yearthree": {
                "moduleone": "Modelling, Simulation and Visualisation, Credits: 20",
                "descriptionone": "The module enables students to develop their IT skills to an advanced level. The module focuses on enhancing BIM, building performance analysis, animation, and 3D modelling and visualisation quality, data intensity and end value. Students will learn to use models for intensive analysis and evaluation.",
                "moduletwo": "Project Management in Architecture 1, Credits: 20",
                "descriptiontwo": "This module develops critical thinking that will enable students to reflect upon best practice in the leadership and management of an architectural design project. Students will be required to justify project management and presentation judgments about the validity of ideas within a prescribed scenario.",
                "modulethree": "Project Management in Architecture 2, Credits: 20",
                "descriptionthree": "This module develops critical thinking that will enable students to reflect upon best practice in the leadership and management of an building construction project. Students will be required to justify construction project management and presentation skills within a prescribed scenario.",
                "modulefour": "Research and Project Design for Architectural Technologists, Credits: 20",
                "descriptionfour": "The purpose of this module is to further develops students? theoretical, analytical, critical and practical skills to devise effective methods of analysis briefs, designing, evaluating, problem-solving, organizing and managing comprehensive architectural design and access statement to a professional standard. This is achieved via completion and presentation of analysis of a given brief, technical report, production of architectural design up to the developed design stage and presentation of the design proposal.",
                "modulefive": "Final Major Project, Credits: 40",
                "descriptionfive": "The purpose of this module is to give the students the opportunity to prove their theoretical, analytical, critical and practical skills to devise effective methods of production of highly-technical project from a developed architectural design scheme up to the technical design stage. This is achieved via completion and presentation of a technical report, architectural and technical designs, detailing, specifications and presentation of a project.",
                "modulesix": "",
                "descriptionsix": ""
            },
            "studentsstatifiedwithcourse": "33%"
        },
        {
            "id": 5,
            "image": "images/criminal.png",
            "course": "Criminal and Corporate Investigation BA (Hons)",
            "ucascode": "L438",
            "level": "Undergraduate",
            "description": "It is essential that all investigations are carried out professionally, so our Criminal and Corporate Investigation course will ensure that you gain the essential legal knowledge and ability to conduct professional investigations whilst securing admissible evidence. The combination of practical role-play based activities and classroom teaching ensures that you are confident in your skills and knowledge, allowing you to be valuable asset to any organisation upon graduation with a criminal investigation degree. If you are interested in a career in professional investigation, or you are an investigator seeking an academic qualification to enhance your skills, then this corporate investigation course will give you the career progression that you seek. The criminal and corporate investigation course provides you with a comprehensive introduction to key theoretical and practical issues, equipping you with the knowledge and skills to confidently undertake professionally conducted investigations.",
            "starting": "September",
            "duration": {
                "fulltime": "3 Years",
                "parttime": "4 - 6 Years",
                "fulltimefoundation": "4 Years"
            },
            "fees": {
                "ukfees": {
                    "fulltime": 9250,
                    "parttime": 1540,
                    "integratedfoundationyear": 9250
                },
                "internationalfees": {
                    "fulltime": 14750,
                    "integratedfoundationyear": 14750
                },
                "optionalworkplacementyear": 0
            },
            "location": "Waterside",
            "contact": {
                "uk/eustudents": {
                    "email": "study@northampton.ac.uk",
                    "phone": "0300 303 2772"
                },
                "internationalstudents": {
                    "email": "international@northampton.ac.uk",
                    "phone": "+44 (0)1604 893981"
                }
            },
            "entryrequirements": {
                "standard": {
                    "alevel": "BCC",
                    "btec": "DMM",
                    "tlevel": "Pass"
                },
                "integratedfoundationyear": {
                    "alevel": "DEE",
                    "btec": "MPP",
                    "tlevel": "Pass"
                },
                "englishlanguagerequirements": "IELTS 6.0 with a minimum of 5.5 in all bands"
            },
            "yearone": {
                "moduleone": "Law and the Criminal Justice System, Credits: 20",
                "descriptionone": "This module provides an insight into the workings of the UK criminal justice. It will benefit students seeking a career within the criminal justice system, enabling them to understand what constitutes a crime, why it is committed, and how the 'criminal' is treated up to, and including the trial/appeal process.",
                "moduletwo": "Legislation for Policing and Investigators, Credits: 20",
                "descriptiontwo": "This module examines legislation that impacts on the practices of the police and investigators such as the Police and Criminal Evidence Act 1984, and the Regulation of Investigatory Powers Act 2000. It also looks at the practical application of legislation, such as, the Theft Act 1968, Fraud Act 2006 and the Protection from Harassment Act 1997.",
                "modulethree": "Theoretical Concepts In Crime Scene Investigations, Credits: 20",
                "descriptionthree": "This module is designed to introduce students to the policing and investigatory responses to critical incidents, major incidents, and other criminal activities. It will provide them with an understanding of the theoretical principles underpinning forensic investigations and evidence recovery.",
                "modulefour": "Introduction to Academic Methods and Research, Credits: 10",
                "descriptionfour": "This module complies with the National Police Curiculum as set by the College of Policing, in particular the module entitles `Research Methods & Skills?. It is designed to ensure that students develop the correct skills, attitudes and approaches to learning which will enable success at HE level.",
                "modulefive": "Introduction to Evidence and Procedure, Credits: 10",
                "descriptionfive": "This module introduces students to the rules, legislation, and codes of practice surrounding this subject area. Students will explore the rationale behind rules of evidence within the criminal justice system, providing them with an awareness of the balance that exists between the interests of the state and rights of individuals.",
                "modulesix": "Introduction to Investigative Interviewing, Credits: 20",
                "descriptionsix": "This module complies with level 1 of the `Professionalising the Investigation Process? (PIP), as defined by the College of Policing. Level 1 is the benchmark introductory standard for police officers and investigative professionals; providing a foundation of knowledge, and the relevant skills to competently interview victims, witnesses and suspects"
            },
            "yeartwo": {
                "moduleone": "Crime and Criminal Investigation, Credits: 20",
                "descriptionone": "This module complies with the College of Policing?s National Police Curriculum by extending the students? legal knowledge from the topics taught in year 1.It explores laws and procedures that are concerned with more serious criminal offences, murder, manslaughter, kidnap and rape, and examines the This processes involved in the investigation of such offences as well as defences in law.",
                "moduletwo": "Academic Development, Credits: 20",
                "descriptiontwo": "This module extends the students? understanding of research methods enabling them to recognise similarities between an investigation and a piece of academic research, eg, an investigative strategy and a research methodology integrity and ethics, presentation of results and presentation of evidence, compliance with regulations and conventions such as writing styles.",
                "modulethree": "Investigation and Investigative Interviewing 2, Credits: 20",
                "descriptionthree": "This module complies with the core requirements of P.I.P. level 2 (Professionalizing the Investigation Process) as defined by the College of Policing and Skills for Justice. `PIP 2? is the benchmark intermediate standard for police officers and investigative professionals. This module further extends the knowledge gained during stage 1.",
                "modulefour": "The Management of Major Investigations, Credits: 20",
                "descriptionfour": "This module is designed to provide students with the knowledge, understanding and skills to be able to conduct investigations in a professional and objective manner. It builds upon the foundation that students have achieved at level 4, introducing them to more strategic considerations such as planning and managing an investigation, dealing with the media, policy logs, management of information/intelligence, and managing expectations. ",
                "modulefive": "Covert Investigations, Credits: 20",
                "descriptionfive": "This module will introduce students to the legislation, and codes of practice that surround covert investigations. It examines the intrusive nature of covert investigation, particularly the controversial balance between the interests of the state and the privacy of the individual within the context of the English criminal justice system.",
                "modulesix": "Investigating Serious and Organised Crime, Credits: 20",
                "descriptionsix": "The purpose of this module is to familiarise students with the nature and impact of criminal behaviour within the fields of drugs, human trafficking, and serious organised crime. Students will explore the subtle interrelationships that link these areas and the subsequent difficulties which arise in terms of their investigation and prosecution."
            },
            "yearthree": {
                "moduleone": "The Victims Voice, Credits: 20",
                "descriptionone": "This module examines the topic of victimology, who becomes a victim and why, what responsibility do victims themselves bear for acts committed against them? It explores the consequences of being labeled `victim?, their rights and support, and it asks, `what voice should victims have in designing of victims? services?",
                "moduletwo": "Advanced Evidence and Procedure, Credits: 20",
                "descriptiontwo": "This module deals with the legal and procedural complexities surrounding the admissability of evidence in the English legal system. Students will undertake a group scenario based exercise requiring them to seize, prepare, and finally present their evidence in the courtroom setting of a mock trial.",
                "modulethree": "Employment Investigations, Credits: 20",
                "descriptionthree": "Employers who fail to conduct lawful and fair investigations may find themselves facing expensive claims for discrimination or wrongful/unfair dismissal. This module is designed to give students a comprehensive understanding of the law relating to individual employment rights and the relevant codes of practice that impact on internal investigations.",
                "modulefour": "Cyber Crime, Credits: 20",
                "descriptionfour": "This module deals with the legal and procedural complexities surrounding the three main areas of cyber crime. Mainly: computer?related offences, computer integrity offences, and internet crimes related to the distribution of illegal content. It examines substantive criminal law in England, comparing it to other jurisdictions and states.",
                "modulefive": "Miscarriages of Justice, Credits: 20",
                "descriptionfive": "This module is mapped against the College of Policing?s `National Police Curiculum?, it looks at the process of `Investigation? from a different angle, seeking to stimulate debate by challenging investigative practices/procedures by introducing students to controversial issues surrounding their subject area. It examines the impact `miscarriages of justice? have had upon victims/witnesses/suspects raising questions about the integrity of the criminal justice system itself.",
                "modulesix": "Independent Study, Credits: 40",
                "descriptionsix": "The independent study provides an opportunity for students to study a topic of vocational relevance in greater depth, and to demonstrate their ability to work within specified timescales. They can choose a subject which they have found of interest during the previous two years of study, or which has direct relevance for their current or prospective employer."
            },
            "studentsstatifiedwithcourse": "79%"
        },
        {
            "id": 6,
            "image": "images/human.png",
            "course": "Human Resource Management MA",
            "level": "Postgraduate",
            "description": "The Human Resource Management MA course modules are designed to provide you with expert knowledge of distinct HR subject areas combined with exposure to contemporary debates, policies and practices, keeping you at the forefront of developments in your field. You will develop an understanding of HRM within a range of organisational contexts, and you will be equipped with the analytical and diagnostic skills required of HR professionals in the workplace",
            "starting": "September",
            "duration": {
                "fulltime": "1 Year",
                "parttime": "2 Year"
            },
            "fees": {
                "ukfees": {
                    "fulltime": 8010,
                    "parttime": 8010
                },
                "internationalfees": {
                    "fulltime": 16500,
                    "parttime": 0
                }
            },
            "location": "Waterside",
            "contact": {
                "uk/eustudents": {
                    "email": "study@northampton.ac.uk",
                    "phone": "0300 303 2772"
                },
                "internationalstudents": {
                    "email": "international@northampton.ac.uk",
                    "phone": "+44 (0)1604 893981"
                }
            },
            "entryrequirements": {
                "postgradentry": "First or Second Class Honours degree from a UK University (or an international equivalent) in human resource management, or in business, commerce, management or related disciplines.",
                "englishlanguagerequirements": "Minimum standard: IELTS 6.5 (or equivalent) for study at postgraduate level."
            },
            "yearone": {
                "moduleone": "Human Resource Management in Context, Credits: 20",
                "descriptionone": "You will explore HRM in a business context to develop your understanding of the increasingly complex environments HR must work within both inside and external to organisations.  This module allows learners to develop analysis skills to facilitate informed choices on which strategies may be most and least appropriate.",
                "moduletwo": "Leading, Managing and Developing People, Credits: 20",
                "descriptiontwo": "You will analyse key factors in leading, managing and developing people for organisational success. Every organisation is made up of individuals whose behaviour, individually or collectively, will impact on its ability to succeed. Organisational performance can be enhanced and increased through the strategic management, leadership and development of people. This module enables you to gain an in-depth knowledge of HRM and HRD and explores major themes from the growing literature and research in this subject area.",
                "modulethree": "International and Comparative HRM, Credits: 20",
                "descriptionthree": "This module aims to provide students with knowledge and understanding to critically appraise the international context of strategic HRM. You will explore the complex social, economics and organisational institutions within which organisations compete and the implications for people management.",
                "modulefour": "Resourcing and Developing Talent, Credits: 30",
                "descriptionfour": "You will evaluate strategies for resourcing and developing talent within the organisation. You will consider the practical aspects of recruitment, selection, employee retention and dismissal and explore the strategic aspects of planning an organisation’s long and short term human resource requirements. This module requires analysis of external labour markets and considerations of flexibility, as well as an understanding of how internal labour markets can become more productive and effective. You will also develop a critical understanding of the role and influence of a range of contextual factors associated with the design, delivery and evaluation of learning and development in a variety of organisational contexts. You will explore and evaluate the contribution of learning and talent development strategies in meeting the ambitions and objectives of the organisation and the individual.",
                "modulefive": "Employment Law and Relations, Credits: 30",
                "descriptionfive": "You will develop and reflect upon your knowledge and understanding of Employment Relations from a number of different perspectives. The holistic significance of employment relations within an organisation is emphasised together with the importance of aligning HR policies with business strategy, change processes, employee voice and involvement practices. Good employee relations are important for an organisation’s success in the achievement of its business objectives and for gaining employee commitment to those objectives. Increasing legislation in this area has also brought pressure to develop appropriate managerial strategies to ensure employee commitment to organisational success. You will analyse key aspects of employment law relevant to the jurisdiction you work in and their practical implications for the operation of HR and management practice.",
                "modulesix": "Dissertation and Research Methods, Credits: 60",
                "descriptionsix": "In semesters 2 and 3 of your masters in HR, you will work on completing a 13,000-word dissertation. You will be supported through introductory class sessions on research methods and on-line materials and you will be allocated a supervisor who will guide and support you through this process."
            }
        },
        {
            "id": 7,
            "image": "images/history.png",
            "course": "History MA",
            "level": "Postgraduate",
            "description": "Our distance learning History MA is taught online on a full-time and part-time basis, with the opportunity to complete in one and two years respectively. The year is split into three trimesters. You will develop the skills necessary to understand, critique, utilise and communicate concepts and theories used within the discipline of History. You will acquire methodological skills for historical research, particularly the selection, evaluation and interpretation of primary sources. The course comprises 120 credits of taught modules and a 60 credit dissertation. Students must take the History Research Methods module and complete a dissertation. The remainder of the programme is made up from a selection of specialist modules (normally three 30 credit modules) which reflect staff research expertise.",
            "starting": "September",
            "duration": {
                "fulltime": "1 Year",
                "parttime": "2 Years"
            },
            "fees": {
                "ukfees": {
                    "fulltime": 8010,
                    "parttime": 1335
                },
                "internationalfees": {
                    "fulltime": 7650,
                    "parttime": 1275
                }
            },
            "location": "Distance Learning",
            "contact": {
                "uk/eustudents": {
                    "email": "study@northampton.ac.uk",
                    "phone": "0300 303 2772"
                },
                "internationalstudents": {
                    "email": "international@northampton.ac.uk",
                    "phone": "+44 (0)1604 893881"
                }
            },
            "entryrequirements": {
                "postgradentry": "Second class degree in History or related discipline.",
                "englishlanguagerequirements": "IELTS 7.0 (or equivalent)"
            },
            "yearone": {
                "moduleone": "Modules",
                "descriptionone": "The course comprises 120 credits of taught modules and a 60 credit dissertation.",
                "moduletwo": "",
                "descriptiontwo": "",
                "modulethree": "",
                "descriptionthree": "",
                "modulefour": "",
                "descriptionfour": "",
                "modulefive": "",
                "descriptionfive": "",
                "modulesix": "",
                "descriptionsix": ""
            }
        },
        {
            "id": 8,
            "image": "images/project.png",
            "course": "Project Management MSc",
            "level": "Postgraduate",
            "description": "Our Project Management Masters is designed to address the growing complexity of projects and incorporates key tools and techniques. You’ll gain an understanding of the core competencies required to drive a successful conclusion, as well as an appreciation of using a more holistic, international and ethical stakeholder project management approach. When you choose to study MSc Project Management at the University of Northampton, you will benefit from the teaching of supportive and dedicated teaching staff with real industry experience. You will also have the opportunity to gain additional, highly-regarded professional project management qualifications in PRINCE2 Foundation, PRINCE2 Practitioner and Agile Project Management Foundation.",
            "starting": "January, June, September",
            "duration": {
                "fulltime": "1 Year",
                "parttime": "N/A",
                "fulltimeplacementyear": "2 Years"
            },
            "fees": {
                "ukfees": {
                    "fulltime": 8010,
                    "parttime": 0
                },
                "internationalfees": {
                    "fulltime": 16500,
                    "parttime": 0
                },
                "optionalworkplacementyear": 1000
            },
            "location": "Waterside",
            "contact": {
                "uk/eustudents": {
                    "email": "study@northampton.ac.uk",
                    "phone": "0300 303 2772"
                },
                "internationalstudents": {
                    "email": "international@northampton.ac.uk",
                    "phone": "+44 (0)1604 893981"
                }
            },
            "entryrequirements": {
                "postgradentry": "First or second class honours degree (or equivalent)",
                "englishlanguagerequirements": "IELTS 6.5 overall with a minimum of 6.0 in writing and 5.5 in all other skills."
            },
            "yearone": {
                "moduleone": "Fundamentals of Project Management, Credits: 20",
                "descriptionone": "Fast moving dynamic development within organisations means that having a basic `toolkit? of modern and de facto project management techniques, with an emphasis on applying these is a vital requirement for project management students. This module develops students? understanding of theoretical practices, practical tools and techniques, and equips them to face the challenges facing project managers today.",
                "moduletwo": "Finance and Procurement Management, Credits: 20",
                "descriptiontwo": "This module evaluates finance and procurement governance in a business context providing the learners with the knowledge, understanding and skills of financial and procurement planning using a variety of techniques.",
                "modulethree": "Critical Issues in Project Management, Credits: 20",
                "descriptionthree": "The purpose of the module to provide a critical discussion and reflection of the contemporary and emerging issues in project management. Moreover, the students will have the opportunity to evaluate related theories and techniques in project management.",
                "modulefour": "Managing Project Teams, Credits: 20",
                "descriptionfour": "The purpose of this module is to equip learners with critical awareness of practical and theoretical concepts associated with managing high performing project teams by examining the management and leadership of teams working in complex organizational contexts. The module will examine the leadership skills and competencies required to create confident and accomplished project leaders.",
                "modulefive": "Social Responsibility and Impact, Credits: 20",
                "descriptionfive": "This module introduces students to the key issues and debates on Social Responsibility and Impact, providing them with the knowledge, tools and skills to critically evaluate the range of complex ethical and/or sustainability issues that businesses may encounter, and to develop sustainable strategies and/or approaches to project development and management.",
                "modulesix": "Business Research Project, Credits: 60",
                "descriptionsix": "The purpose of this module is to offer the opportunity to the learners to develop skills in completing an investigative research project. The students will use their project management skills, their specialist skills gained in other modules and they will work towards successfully completing the capstone project of their masters degree."
            }
        },
        {
            "id": 9,
            "image": "images/strength.png",
            "course": "Strength and Conditioning MSc",
            "level": "Postgraduate",
            "description": "The Strength and Conditioning MSc course will examine advanced and current aspects of strength and conditioning – exploring the science behind S&C – such as the development of strength, speed and power. The practical training sessions are designed to help you develop the skills and knowledge required to become an applied practitioner. The course will culminate with you conducting a research project, allowing you to demonstrate an advanced understanding of the research process. You will complete the project with the intention of submitting your findings to relevant conferences and journals for publication.",
            "starting": "September",
            "duration": {
                "fulltime": "1 Year",
                "parttime": "2 Years"
            },
            "fees": {
                "ukfees": {
                    "fulltime": 8010,
                    "parttime": 890
                },
                "internationalfees": {
                    "fulltime": 16500,
                    "parttime": 0
                }
            },
            "location": "Waterside",
            "contact": {
                "uk/eustudents": {
                    "email": "study@northampton.ac.uk",
                    "phone": "0300 303 2772"
                },
                "internationalstudents": {
                    "email": "international@northampton.ac.uk",
                    "phone": "+44 (0)1604 893981"
                }
            },
            "entryrequirements": {
                "postgradentry": "2:2 honours degree in a relevant subject area.",
                "englishlanguagerequirements": "IELTS 6.5 (or equivalent) with a minimum of 5.5 in all bands"
            },
            "yearone": {
                "moduleone": "Strength and Conditioning for Specific Athletes, Credits: 20",
                "descriptionone": "The purpose of this module is to provide students with an understanding of strength and conditioning provision for specific athletic groups such as children, adolescents, injured, female, and disabled athletes.",
                "moduletwo": "Strength and Conditioning Techniques, Credits: 20",
                "descriptiontwo": "This primarily practical module seeks to develop professional competencies of strength and conditioning coaches. It will enable students to effectively demonstrate strength and conditioning strategies that are used to facilitate performance enhancement.",
                "modulethree": "Strength and Conditioning Science, Credits: 20",
                "descriptionthree": "The purpose of this module is to provide students with a detailed understanding of the physiological and mechanical principles that govern effective strength and conditioning training. Students will also learn how to analyse training data to identify performance trends that can be fed back to coaches and athletes. ",
                "modulefour": "Research Methods, Credits: 20",
                "descriptionfour": "This module will focus on examining a specific area of interest chosen by the student, to develop their understanding of the research process and designing and developing a valid research proposal. It will also advance the students understanding of concepts, principles and techniques associated with quantitative and qualitative statistical analyses commonly used in research projects.",
                "modulefive": "Applied Practice, Credits: 40",
                "descriptionfive": "Applied Practice provides an opportunity for students to apply complex theoretical knowledge, innovative ideas and strategies to autonomously investigate a novel idea/proposition to a real world setting relevant to their chosen pathway through engagement in a work-based learning environment.",
                "modulesix": "Sport Dissertation (MSc), Credits: 60",
                "descriptionsix": "The module provides an opportunity for the student to apply knowledge, concepts, and research techniques to a question or problem in a specific discipline within their studies. The module builds and expands on students' prior knowledge and aims to develop expertise and understanding of the scientific process including research methodology, skills to execute planning, conducting, analysis and writing up of their research."
            }
        },
        {
            "id": 10,
            "image": "images/counseling.png",
            "course": "Counselling MSc",
            "level": "Postgraduate",
            "description": "The Counselling MSc at UON has been designed to contribute towards achieving the following United Nations Sustainable Development Goal: SDG3 Good Health and Wellbeing. This Masters in Counselling course will help you to achieve sufficient communication skills as well as personal development skills which are useful and applicable to a number of organisations and situations. Students will be integrated into the learning process partnered with a supportive and motivational environment.",
            "starting": "September",
            "duration": {
                "fulltime": "N/A",
                "parttime": "2 Years"
            },
            "fees": {
                "ukfees": {
                    "fulltime": 0,
                    "parttime": 4005
                },
                "internationalfees": {
                    "fulltime": 0,
                    "parttime": 0
                }
            },
            "location": "Waterside",
            "contact": {
                "uk/eustudents": {
                    "email": "study@northampton.ac.uk",
                    "phone": "0300 303 2772"
                }
            },
            "entryrequirements": {
                "postgradentry": "first or second class bachelors degree.",
                "englishlanguagerequirements": "IELTS 6.5 overall (or equivalent)"
            },
            "yearone": {
                "moduleone": "Qualitative and Quantitative Research Methods, Credits: 10",
                "descriptionone": "The purpose of this module is to provide students with the opportunity and resources to develop a critical understanding of research methods so that they can evaluate research they read and/or propose research of an acceptable standard.",
                "moduletwo": "Counselling Skills and Process, Credits: 30",
                "descriptiontwo": "The purpose of this module is ?To develop a clear understanding of the process and content involved in counselling.To provide the opportunity to practise skills competencies in role play scenarios, incorporate theory to underpin practice and reflect on their process and way of being as a counsellor.",
                "modulethree": "Placement and Supervision, Credits: 30",
                "descriptionthree": "The purpose of this module is ?To successfully and competently complete 100 hours of supervised practise in an approved placement organisation.To attend and fully utilise appropriate levels of supervision for all client work with an approved supervisor.",
                "modulefour": "Self-Awareness and Reflectiveness, Credits: 20",
                "descriptionfour": "The purpose of this module is ?To critically reflect on thoughts, feelings and behaviour in development of self-awareness.To recognise personal and professional limitations and identify ways of addressing these.",
                "modulefive": "Counselling Theory and Practice, Credits: 40",
                "descriptionfive": "The purpose of this module is ?To develop an in-depth understanding of counselling theory and organisational issues pertaining to counselling practice.To provide the opportunity to examine presenting issues and concerns in counselling practice and ways of working with these underpinned by evidence based practice.",
                "modulesix": "Dissertation and Research Methods, Credits: 50",
                "descriptionsix": "The purpose of this module is ?To build on basic research methods skills from modules PSYM085 or PSYM102. The module is designed to develop advanced research skills enabling students to autonomously formulate and conduct an empirical research project in a field relevant to individual masters programs under supervision."
            }
        }
    ]
}